In [1]:
import numpy as np
import pandas as pd

In [19]:
import pandas as pd

df1 = pd.read_csv('bestsellers.csv')

print(df1)

                                                  Name  \
0                        10-Day Green Smoothie Cleanse
1                                    11/22/63: A Novel
2              12 Rules for Life: An Antidote to Chaos
3                               1984 (Signet Classics)
4    5,000 Awesome Facts (About Everything!) (Natio...
..                                                 ...
545       Wrecking Ball (Diary of a Wimpy Kid Book 14)
546  You Are a Badass: How to Stop Doubting Your Gr...
547  You Are a Badass: How to Stop Doubting Your Gr...
548  You Are a Badass: How to Stop Doubting Your Gr...
549  You Are a Badass: How to Stop Doubting Your Gr...

                       Author  User Rating  Reviews  Price  Year        Genre
0                    JJ Smith          4.7    17350      8  2016  Non Fiction
1                Stephen King          4.6     2052     22  2011      Fiction
2          Jordan B. Peterson          4.7    18979     15  2018  Non Fiction
3               George Orwell          4.7    21424      6  2017      Fiction
4    National Geographic Kids          4.8     7665     12  2019  Non Fiction
..                        ...          ...      ...    ...   ...          ...
545               Jeff Kinney          4.9     9413      8  2019      Fiction
546               Jen Sincero          4.7    14331      8  2016  Non Fiction
547               Jen Sincero          4.7    14331      8  2017  Non Fiction
548               Jen Sincero          4.7    14331      8  2018  Non Fiction
549               Jen Sincero          4.7    14331      8  2019  Non Fiction

[550 rows x 7 columns]

In [25]:
df2=pd.read_json('data.json')
df2

               Name         Country             House    Reign  ID
0  Edward the Elder  United Kingdom   House of Wessex  899-925   1
1         Athelstan           China  House in Beijing  925-940   2
2            Edmund           India    House in Delhi  940-946   3
3             Edred  United Kingdom   House of Wessex  946-955   4
4              Edwy       Australia    House in Wales  955-959   5

In [28]:
df3=pd.read_json('Data (1).json')
# print statement doesnt give whole dataset
df3

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [29]:
df3=pd.read_json('Data (1).json')
# to_string() gives whole dataset
print(df3.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.5
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.5
37         60    100       120     300.1
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.1
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [30]:
df_json_final = pd.DataFrame(df3)
df_json_final

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [31]:
print(type(df_json_final))

<class 'pandas.core.frame.DataFrame'>

In [32]:
df1.head()  #read first 5 rows only

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [35]:
df1.head(30)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction
5,A Dance with Dragons (A Song of Ice and Fire),George R. R. Martin,4.4,12643,11,2011,Fiction
6,A Game of Thrones / A Clash of Kings / A Storm...,George R. R. Martin,4.7,19735,30,2014,Fiction
7,A Gentleman in Moscow: A Novel,Amor Towles,4.7,19699,15,2017,Fiction
8,"A Higher Loyalty: Truth, Lies, and Leadership",James Comey,4.7,5983,3,2018,Non Fiction
9,A Man Called Ove: A Novel,Fredrik Backman,4.6,23848,8,2016,Fiction
10,A Man Called Ove: A Novel,Fredrik Backman,4.6,23848,8,2017,Fiction
11,A Patriot's History of the United States: From...,Larry Schweikart,4.6,460,2,2010,Non Fiction
12,A Stolen Life: A Memoir,Jaycee Dugard,4.6,4149,32,2011,Non Fiction
13,A Wrinkle in Time (Time Quintet),Madeleine L'Engle,4.5,5153,5,2018,Fiction
14,"Act Like a Lady, Think Like a Man: What Men Re...",Steve Harvey,4.6,5013,17,2009,Non Fiction
15,Adult Coloring Book Designs: Stress Relief Col...,Adult Coloring Book Designs,4.5,2313,4,2016,Non Fiction
16,Adult Coloring Book: Stress Relieving Animal D...,Blue Star Coloring,4.6,2925,6,2015,Non Fiction
17,Adult Coloring Book: Stress Relieving Patterns,Blue Star Coloring,4.4,2951,6,2015,Non Fiction
18,Adult Coloring Books: A Coloring Book for Adul...,Coloring Books for Adults,4.5,2426,8,2015,Non Fiction
19,Alexander Hamilton,Ron Chernow,4.8,9198,13,2016,Non Fiction
20,All the Light We Cannot See,Anthony Doerr,4.6,36348,14,2014,Fiction
21,All the Light We Cannot See,Anthony Doerr,4.6,36348,14,2015,Fiction
22,Allegiant,Veronica Roth,3.9,6310,13,2013,Fiction
23,American Sniper: The Autobiography of the Most...,Chris Kyle,4.6,15921,9,2015,Non Fiction
24,And the Mountains Echoed,Khaled Hosseini,4.3,12159,13,2013,Fiction
25,Arguing with Idiots: How to Stop Small Minds a...,Glenn Beck,4.6,798,5,2009,Non Fiction
26,Astrophysics for People in a Hurry,Neil deGrasse Tyson,4.7,9374,9,2017,Non Fiction
27,"Autobiography of Mark Twain, Vol. 1",Mark Twain,4.2,491,14,2010,Non Fiction
28,Baby Touch and Feel: Animals,DK,4.6,5360,5,2015,Non Fiction
29,Balance (Angie's Extreme Stress Menders),Angie Grace,4.6,1909,11,2015,Non Fiction

In [39]:
df1.tail()   #read last 5 rows

,Name,Author,User Rating,Reviews,Price,Year,Genre
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction

In [40]:
df1.tail(10)

,Name,Author,User Rating,Reviews,Price,Year,Genre
540,Wonder,R. J. Palacio,4.8,21625,9,2013,Fiction
541,Wonder,R. J. Palacio,4.8,21625,9,2014,Fiction
542,Wonder,R. J. Palacio,4.8,21625,9,2015,Fiction
543,Wonder,R. J. Palacio,4.8,21625,9,2016,Fiction
544,Wonder,R. J. Palacio,4.8,21625,9,2017,Fiction
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction

In [42]:
# We can get info about our data using info() method.
# The info() method provides the essential information about our dataset:
# 1. the number of rows and columns
# 2. the number of non-null values
# 3. the type of data is in each column.
# 4. the amount of memory our dataframe is using
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         550 non-null    object
 1   Author       550 non-null    object
 2   User Rating  550 non-null    float64
 3   Reviews      550 non-null    int64
 4   Price        550 non-null    int64
 5   Year         550 non-null    int64
 6   Genre        550 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 23.7+ KB

In [43]:
# The shape attribute is a useful attribute that displays shape, i.e, tuple of rows and columns
df1.shape

(550, 7)

In [44]:
# To print the column names  of our dataframe use .column attribute
df1.columns

Index(['Name', 'Author', 'User Rating', 'Reviews', 'Price', 'Year', 'Genre'], dtype='object')

In [45]:
#  the rename() method to rename some or all columns of a datafram via a dict
df1.rename(columns={
    'Author':'Writer',
    'Price':'Amount'
}, inplace=True)
df1.columns

Index(['Name', 'Writer', 'User Rating', 'Reviews', 'Amount', 'Year', 'Genre'], dtype='object')

In [53]:
df_ramen=pd.read_csv('ramen-ratings.csv')
df_ramen

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00,NaN
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,NaN,NaN
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
...,...,...,...,...,...,...,...
2575,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.50,NaN
2576,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1.00,NaN
2577,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2.00,NaN
2578,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2.00,NaN
2579,1,Westbrae,Miso Ramen,Pack,USA,0.50,NaN

In [54]:
# Demo to Handle Nulls in each column of our dataset.
# isnull() returns a dataframe with each cell either true or false depending on cell's null status.
df_ramen.isnull()

      Review #  Brand  Variety  Style  Country  Stars  Top Ten
0        False  False    False  False    False  False     True
1        False  False    False  False    False  False     True
2        False  False    False  False    False   True     True
3        False  False    False  False    False  False     True
4        False  False    False  False    False  False     True
...        ...    ...      ...    ...      ...    ...      ...
2575     False  False    False  False    False  False     True
2576     False  False    False  False    False  False     True
2577     False  False    False  False    False  False     True
2578     False  False    False  False    False  False     True
2579     False  False    False  False    False  False     True

[2580 rows x 7 columns]

In [56]:
# To count the number of nulls in each columns using an aggregate function
# isnull() method is usually used in conjunction with methods like sum
df_ramen=pd.read_csv('ramen-ratings.csv')
df_ramen.isnull().sum()

Review #       0
Brand          0
Variety        0
Style          2
Country        0
Stars         21
Top Ten     2539
dtype: int64

In [59]:
# Imputation
# Now filling null values using fillna() ins "Style" column:

df_ramen["Style"].fillna("No Pack", inplace=True)  #No Pack is constant or default value
df_ramen.isnull().sum()

Review #       0
Brand          0
Variety        0
Style          0
Country        0
Stars         21
Top Ten     2539
dtype: int64

In [61]:
# now filling null values using fillna() in "Top Ten" column:
df_ramen["Top Ten"].fillna("No Rank", inplace=True)
df_ramen.isnull().sum()

Review #     0
Brand        0
Variety      0
Style        0
Country      0
Stars       21
Top Ten      0
dtype: int64

In [62]:
df_ramen

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,No Rank
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00,No Rank
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,NaN,No Rank
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,No Rank
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,No Rank
...,...,...,...,...,...,...,...
2575,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.50,No Rank
2576,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1.00,No Rank
2577,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2.00,No Rank
2578,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2.00,No Rank
2579,1,Westbrae,Miso Ramen,Pack,USA,0.50,No Rank

In [63]:
mean_val = df_ramen["Stars"].mean()
mean_val

3.6505861664712773

In [65]:
# Replace null values in "Stars" with mean_val
df_ramen["Stars"].fillna(value=mean_val, inplace=True)
df_ramen

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.750000,No Rank
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.000000,No Rank
2,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,3.650586,No Rank
3,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.750000,No Rank
4,2576,Ching's Secret,Singapore Curry,Pack,India,3.750000,No Rank
...,...,...,...,...,...,...,...
2575,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.500000,No Rank
2576,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1.000000,No Rank
2577,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2.000000,No Rank
2578,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2.000000,No Rank
2579,1,Westbrae,Miso Ramen,Pack,USA,0.500000,No Rank

In [70]:
# Change datatype of any column using dictionary format
value_changetype={
    'Stars': int
        }
df_ramen=df_ramen.astype(value_changetype)
print(df_ramen.dtypes)

Review #     int64
Brand       object
Variety     object
Style       object
Country     object
Stars        int32
Top Ten     object
dtype: object

In [73]:
# A method .value_counts() gives the frequency of all values in a column
# frequency- number of occurrences/repeatitions
df_ramen['Brand'].value_counts().head(50)     #head(20) will print onlt first top 20 rows

Nissin              381
Nongshim             98
Maruchan             76
Mama                 71
Paldo                66
Myojo                63
Indomie              53
Samyang Foods        52
Ottogi               46
Lucky Me!            34
Vina Acecook         34
Vifon                33
Maggi                30
Mamee                29
Master Kong          28
MAMA                 27
A-Sha Dry Noodle     26
KOKA                 25
Wai Wai              25
Sapporo Ichiban      25
MyKuali              24
Ve Wong              24
JML                  23
Samyang              19
Koka                 18
Batchelors           16
Doll                 16
Mr. Noodles          15
Kamfen               15
Acecook              15
Wei Lih              15
Takamori Kosan       14
Asian Thai Foods     14
Little Cook          14
Sau Tao              14
Vit's                13
Deshome              13
Unif                 13
Dragonfly            13
Saigon Ve Wong       13
Wu-Mu                12
Annie Chun's         12
Uni-President        12
Yum Yum              12
ABC                  12
Mi Sedaap            12
Golden Wheat         12
Shirakiku            11
Baijia               11
Pot Noodle           11
Name: Brand, dtype: int64

In [77]:
df_ramen['Style'].value_counts()

# Most frequently used style: Pack
# Least Used: bar/can

Pack       1531
Bowl        481
Cup         450
Tray        108
Box           6
No Pack       2
Can           1
Bar           1
Name: Style, dtype: int64